#include <iostream>
using namespace std;

class Matrix {
private: // создаем приватную часть что бы ее внутренности не повредились
    int rows, cols;//они важны что бы фунция не поломалась
    float* a;

public:
    Matrix() { // создает пустую матрицу
        rows = 0; // кол-во строк матрицы
        cols = 0; // кол-во столбцов матрицы
        a = 0; // сама матрица
    }

    Matrix(int r, int c) { // создание заполненой матрицы
        rows = r; // записуем количество строк
        cols = c; // записуем количество столбцов
        a = new float[rows * cols + 1]; // создание массива нужного размера || выделяем нужное кол-во памяти

        for (int i = 0; i < rows * cols; i++) // проход по всем элементам матрицы
            a[i] = 0; // заполняем нулями
    }

    Matrix(const Matrix& m) { // создании копии матрицы
        rows = m.rows; // делаем их такое же кол-во рядов
        cols = m.cols; // делаем их такое же кол-во строк
        a = new float[rows * cols]; // создание массива нужного размера || выделяем нужное кол-во памяти

        for (int i = 0; i < rows * cols; i++) // проход по всем элементам матрицы
            a[i] = m.a[i]; // заполняем цифрами передаваемого массива 
    }

    ~Matrix() { // деструктор, вызывается при удалении матрицы
        delete[] a;  // освобождаем память, выделенную под элементы матрицы
    }

    Matrix& operator=(const Matrix& m) { // оператор присваивания: A = B
        if (this == &m) //если таблица таже то присваиваем ее себе же
            return *this; //ничего не меняем

        delete[] a; // освобождаем память

        rows = m.rows; // делаем их такое же кол-во рядов
        cols = m.cols; // делаем их такое же кол-во строк
        a = new float[rows * cols]; // создание массива нужного размера || выделяем нужное кол-во памяти

        for (int i = 0; i < rows * cols; i++) // проход по всем элементам матрицы
            a[i] = m.a[i]; // заполняем цифрами передаваемого массива

        return *this; // возвращаем текущую матрицу
    }

    float& operator()(int i, int j) { // оператор ()
        return a[i * cols + j]; // возвращает элемент по ряду i, по столбцу j
    }

    Matrix operator+(const Matrix& m) { // сложение двух матриц
        Matrix res(rows, cols);  // создание матрицы для ответа

        for (int i = 0; i < rows * cols; i++) // проход по всем элементам матрицы
            res.a[i] = a[i] + m.a[i]; // i-тый элемент 1ой матрицы + i-тый элемент 2ой матрицы

        return res; // возвращаем результат
    }

    Matrix operator+(float x) { // сложение матрицы и floatа
        Matrix res(rows, cols); // создание матрицы для ответа

        for (int i = 0; i < rows * cols; i++) // проход по всем элементам матрицы
            res.a[i] = a[i] + x; // i-тый элемент матрицы + float

        return res; // возвращаем результат
    }

    Matrix operator-(const Matrix& m) { // матрица - матрица
        Matrix res(rows, cols); // создание матрицы для ответа

        for (int i = 0; i < rows * cols; i++) // проход по всем элементам матрицы
            res.a[i] = a[i] - m.a[i]; // iтый элемент матрицы1 - iтый элемент матрицы2

        return res; // возвращаем результат
    }

    Matrix operator-() { // унарный минус
        Matrix res(rows, cols); // создание матрицы для ответа

        for (int i = 0; i < rows * cols; i++) // проход по всем элементам матрицы
            res.a[i] = -a[i]; // i-тый элемент матрицы  = отриц. i-тый элемент матрицы

        return res; // возвращаем результат
    }

    Matrix operator*(const Matrix& m) {
        Matrix res(rows, m.cols); // создание матрицы для ответа

        for (int i = 0; i < rows; i++) // переход по строкам результата
            for (int j = 0; j < m.cols; j++) // переход по столбцам результата
                for (int k = 0; k < cols; k++) // // перебираем элементы строки матрицы1 и столбца матрицы2
                    res(i, j) += (*this)(i, k) * m.a[k * m.cols + j]; // C00​=A00​*B00​+A01​*B10​ | C01​=A00​*B01​+A01​*B11​ | C10​=A10​*B00​+A11*B10​ | C11​=A10​*B01​+A11​*B11​ по матрицам 2 на 2

        return res; // возвращаем результат
    }

    Matrix operator*(float x) { // умножение на float
        Matrix res(rows, cols); // создание матрицы для ответа

        for (int i = 0; i < rows * cols; i++) // проход по всем элементам матрицы
            res.a[i] = a[i] * x; // i-тый элемент матрицы  = i-тый элемент матрицы * float

        return res; // возвращаем результат
    }

    void swap_rows(int r1, int r2) { // r1 и r2 строки который меняем
        for (int j = 0; j < cols; j++) { // проходим по всем столбцам
            float t = (*this)(r1, j); // сохраняем элемент первой строки
            (*this)(r1, j) = (*this)(r2, j); // ставим на его место элемент второй строки
            (*this)(r2, j) = t; // во вторую строку ставим сохранённый элемент
        }
    }

    void swap_columns(int c1, int c2) { // c1 и c2 столбцы который меняем
        for (int i = 0; i < rows; i++) { // проходим по всем строкам
            float t = (*this)(i, c1); // сохраняем элемент первого столбца
            (*this)(i, c1) = (*this)(i, c2); // ставим на его место элемент второго столбца
            (*this)(i, c2) = t; // во второй столбец ставим сохранённый элемент
        }
    }

    void input() { // ввод || пробел и энтер разделяют строчку поэтому так и так работает
        for (int i = 0; i < rows * cols; i++)
            cin >> a[i]; // ввод элемента
    }

    void print() { // вывод
        for (int i = 0; i < rows; i++) { // переход по строкам
            for (int j = 0; j < cols; j++) // переход по столбцам
                cout << (*this)(i, j) << " "; // вывод элемента по строке i и столбцу j этой матрицы(переданной) а затем вывод пробела
            cout << endl; // переход на новую строку, происходит когда по всем элементам строки j уже прошла
        }
    }
};

int main() {
    Matrix A(2, 2), B(2, 2);

    A.input();
    B.input();

    Matrix C = A + B;
    Matrix D = A - B;
    Matrix E = A * B;

    Matrix F = A + 5.0f;
    Matrix G = A * 2.0f;

    cout << "A + B:" << endl;
    C.print();
    cout << "-------------------" << endl;
    cout << "A - B:" << endl;
    D.print();
    cout << "-------------------" << endl;
    cout << "A * B:" << endl;
    E.print();
    cout << "-------------------" << endl;
    cout << "A + 5:" << endl;
    F.print();
    cout << "-------------------" << endl;
    cout << "A * 2:" << endl;
    G.print();

    return 0;
}