#include <iostream>     // для cout и cin
#include <stdexcept>    // для exception, invalid_argument, out_of_range

using namespace std;

// ======================================================
// КЛАСС MATRIX
// ======================================================

class Matrix {

private:

    int rows;   // количество строк
    int cols;   // количество столбцов

    float* a;   // динамический массив элементов матрицы


public:

    // ======================================================
    // КОНСТРУКТОР ПО УМОЛЧАНИЮ
    // Создает пустую матрицу
    // ======================================================
    Matrix() {

        rows = 0;
        cols = 0;

        a = nullptr; // nullptr = память не выделена
    }


    // ======================================================
    // КОНСТРУКТОР С РАЗМЕРАМИ
    // r = количество строк
    // c = количество столбцов
    // ======================================================

    Matrix(int r, int c) {

        // Проверка:
        // размеры матрицы должны быть больше нуля
        if (r <= 0 || c <= 0)
            throw invalid_argument(
                "Размер матрицы должен быть больше 0"
            );

        // сохраняем размеры
        rows = r;
        cols = c;

        // выделяем память:
        // rows * cols элементов типа float
        a = new float[rows * cols];

        // заполняем матрицу нулями
        for (int i = 0; i < rows * cols; i++)
            a[i] = 0;
    }


    // ======================================================
    // КОНСТРУКТОР КОПИРОВАНИЯ
    // Вызывается при:
    //
    // Matrix B = A;
    //
    // Нужен чтобы копировались ДАННЫЕ,
    // а не только указатель
    // ======================================================

    Matrix(const Matrix& m) {

        // копируем размеры
        rows = m.rows;
        cols = m.cols;

        // выделяем новую память
        a = new float[rows * cols];

        // копируем все элементы
        for (int i = 0; i < rows * cols; i++)
            a[i] = m.a[i];
    }


    // ======================================================
    // ДЕСТРУКТОР
    // Освобождает память
    // Вызывается автоматически
    // ======================================================

    ~Matrix() {

        // освобождаем память массива
        delete[] a;
    }


    // ======================================================
    // ОПЕРАТОР ПРИСВАИВАНИЯ
    //
    // A = B;
    //
    // ======================================================

    Matrix& operator=(const Matrix& m) {

        // защита от:
        //
        // A = A;
        //
        // если это один и тот же объект —
        // ничего не делаем
        if (this == &m)
            return *this;

        // удаляем старую память
        delete[] a;

        // копируем размеры
        rows = m.rows;
        cols = m.cols;

        // выделяем новую память
        a = new float[rows * cols];

        // копируем элементы
        for (int i = 0; i < rows * cols; i++)
            a[i] = m.a[i];

        // возвращаем текущий объект
        return *this;
    }


    // ======================================================
    // ОПЕРАТОР ()
    //
    // Позволяет обращаться:
    //
    // A(1, 2)
    //
    // вместо:
    //
    // A.a[...]
    //
    // ИНДЕКСАЦИЯ С 1 !!!
    // ======================================================

    float& operator()(int i, int j) {

        // проверка выхода за границы

        if (i < 1 || i > rows ||
            j < 1 || j > cols)

            throw out_of_range(
                "Индекс вне границ матрицы"
            );

        // перевод двумерных индексов
        // в одномерный массив
        //
        // (i - 1) * cols + (j - 1)
        //
        // пример:
        //
        // матрица 2x2
        //
        // [1 2]
        // [3 4]
        //
        // хранится:
        //
        // [1 2 3 4]
        //
        // A(2,1) -> индекс 2

        return a[(i - 1) * cols + (j - 1)];
    }


    // ======================================================
    // CONST ВЕРСИЯ operator()
    //
    // нужна для const объектов
    // ======================================================

    const float& operator()(int i, int j) const {

        if (i < 1 || i > rows ||
            j < 1 || j > cols)

            throw out_of_range(
                "Индекс вне границ матрицы"
            );

        return a[(i - 1) * cols + (j - 1)];
    }


    // ======================================================
    // СЛОЖЕНИЕ МАТРИЦ
    //
    // C = A + B;
    // ======================================================

    Matrix operator+(const Matrix& m) const {

        // размеры должны совпадать
        if (rows != m.rows ||
            cols != m.cols)

            throw invalid_argument(
                "Размеры матриц не совпадают"
            );

        // создаем результирующую матрицу
        Matrix res(rows, cols);

        // складываем элементы
        for (int i = 0; i < rows * cols; i++)
            res.a[i] = a[i] + m.a[i];

        return res;
    }


    // ======================================================
    // МАТРИЦА + ЧИСЛО
    //
    // A + 5
    // ======================================================

    Matrix operator+(float x) const {

        Matrix res(rows, cols);

        // прибавляем число
        // к каждому элементу
        for (int i = 0; i < rows * cols; i++)
            res.a[i] = a[i] + x;

        return res;
    }


    // ======================================================
    // ВЫЧИТАНИЕ МАТРИЦ
    //
    // C = A - B;
    // ======================================================

    Matrix operator-(const Matrix& m) const {

        // размеры должны совпадать
        if (rows != m.rows ||
            cols != m.cols)

            throw invalid_argument(
                "Размеры матриц не совпадают"
            );

        Matrix res(rows, cols);

        // вычитаем элементы
        for (int i = 0; i < rows * cols; i++)
            res.a[i] = a[i] - m.a[i];

        return res;
    }


    // ======================================================
    // УНАРНЫЙ МИНУС
    //
    // B = -A;
    // ======================================================

    Matrix operator-() const {

        Matrix res(rows, cols);

        // меняем знак
        // у каждого элемента
        for (int i = 0; i < rows * cols; i++)
            res.a[i] = -a[i];

        return res;
    }


    // ======================================================
    // УМНОЖЕНИЕ МАТРИЦ
    //
    // C = A * B;
    //
    // Формула:
    //
    // C[i][j] += A[i][k] * B[k][j]
    // ======================================================

    Matrix operator*(const Matrix& m) const {

        // для умножения:
        //
        // количество столбцов первой
        // матрицы должно быть равно
        // количеству строк второй

        if (cols != m.rows)

            throw invalid_argument(
                "Нельзя умножить матрицы"
            );

        // результат:
        //
        // rows x m.cols

        Matrix res(rows, m.cols);


        // ==========================================
        // ТРОЙНОЙ ЦИКЛ УМНОЖЕНИЯ
        // ==========================================

        for (int i = 1; i <= rows; i++) {

            // идем по столбцам результата
            for (int j = 1; j <= m.cols; j++) {

                // считаем сумму произведений
                for (int k = 1; k <= cols; k++) {

                    res(i, j) +=
                        (*this)(i, k) * m(k, j);
                }
            }
        }

        return res;
    }


    // ======================================================
    // УМНОЖЕНИЕ НА ЧИСЛО
    //
    // A * 2
    // ======================================================

    Matrix operator*(float x) const {

        Matrix res(rows, cols);

        // умножаем каждый элемент
        for (int i = 0; i < rows * cols; i++)
            res.a[i] = a[i] * x;

        return res;
    }


    // ======================================================
    // ПЕРЕСТАНОВКА СТРОК
    // ======================================================

    void swap_rows(int r1, int r2) {

        // проверка номеров строк
        if (r1 < 1 || r1 > rows ||
            r2 < 1 || r2 > rows)

            throw out_of_range(
                "Неверный номер строки"
            );

        // меняем строки местами
        for (int j = 1; j <= cols; j++) {

            float temp = (*this)(r1, j);

            (*this)(r1, j) =
                (*this)(r2, j);

            (*this)(r2, j) = temp;
        }
    }


    // ======================================================
    // ПЕРЕСТАНОВКА СТОЛБЦОВ
    // ======================================================

    void swap_columns(int c1, int c2) {

        // проверка номеров столбцов
        if (c1 < 1 || c1 > cols ||
            c2 < 1 || c2 > cols)

            throw out_of_range(
                "Неверный номер столбца"
            );

        // меняем столбцы местами
        for (int i = 1; i <= rows; i++) {

            float temp = (*this)(i, c1);

            (*this)(i, c1) =
                (*this)(i, c2);

            (*this)(i, c2) = temp;
        }
    }


    // ======================================================
    // ВВОД МАТРИЦЫ
    // ======================================================

    void input() {

        cout << "Введите элементы матрицы "
            << rows << "x" << cols << ":\n";

        // вводим элементы
        for (int i = 1; i <= rows; i++) {

            for (int j = 1; j <= cols; j++) {

                cin >> (*this)(i, j);
            }
        }
    }



    // ВЫВОД МАТРИЦЫ


    void print() const {
        // вывод по строкам
        for (int i = 1; i <= rows; i++) {
            for (int j = 1; j <= cols; j++) {
                cout << (*this)(i, j) << " ";
            }
            cout << endl;
        }
    }
};

// MAIN

int main() {
    setlocale(LC_ALL, "RUSSIAN");
    try {

        // создаем две матрицы 2x2
        Matrix A(2, 2);
        Matrix B(2, 2);

        // ввод матриц
        A.input();
        B.input();

        // операции над матрицами
        Matrix C = A + B;
        Matrix D = A - B;
        Matrix E = A * B;

        // операции с числами
        Matrix F = A + 5.0f;
        Matrix G = A * 2.0f;

        // вывод результатов

        cout << "\nA + B:\n";
        C.print();

        cout << "\nA - B:\n";
        D.print();

        cout << "\nA * B:\n";
        E.print();

        cout << "\nA + 5:\n";
        F.print();

        cout << "\nA * 2:\n";
        G.print();
    }

    // обработка ошибок
    catch (const exception& e) {

        cout << "\nОшибка: "
            << e.what() << endl;
    }

    return 0;
}